app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---

               <% @book.book_comments.each do |book_comment| %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
               <%= link_to book_favorites_path(@book), method: :delete do %>
                ♥<%=@book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
              <%= link_to book_favorites_path(@book), method: :post do %>
               ♡<%= @book.favorites.count %>

SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
              <td>
               コメント数: <%= @book.book_comments.count %>

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---

               <% @book.book_comments.each do |book_comment| %>