app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
    to  = Time.current.at_end_of_day
    from  = (to - 6.day).at_beginning_of_day
    @books = Book.includes(:favorited_users).
    sort{|a,b|

INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "a"], ["body", "aaaaaaa"], ["user_id", 1], ["created_at", "2021-06-02 01:10:35.106510"], ["updated_at", "2021-06-02 01:10:35.106510"]]
SELECT "books".* FROM "books"
---
  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
       redirect_to book_path(@book.id),notice:"You have created book successfully."
    else
      @books = Book.all